Repository: ruslanlap/CommunityPowerToysRunPlugin-QuickNotes
Catalog: QuickNotes/Community.PowerToys.Run.Plugin.QuickNotes/Properties/Resources.*.resx
Languages: uk, zh_cn

# PluginName
source: QuickNotes
uk: Швидкі нотатки
zh_cn: 快速笔记

# PluginDescription
source: Save, view, manage, search, tag, and pin quick notes
uk: Зберігайте, переглядайте, керуйте, шукайте, тегуйте та закріплюйте швидкі нотатки
zh_cn: 保存、查看、管理、搜索、标签和置顶快速笔记

# CommandHelp
source: Show help with available commands ℹ️
uk: Показати довідку з доступними командами ℹ️
zh_cn: 显示帮助和可用命令 ℹ️

# CommandBackup
source: Create a backup of notes 💾
uk: Створити резервну копію нотаток 💾
zh_cn: 创建笔记备份 💾

# CommandExport
source: Export notes to a file 💾
uk: Експортувати нотатки у файл 💾
zh_cn: 导出笔记到文件 💾

# CommandEdit
source: Edit note by number 📝
uk: Редагувати нотатку за номером 📝
zh_cn: 按编号编辑笔记 📝

# CommandView
source: View note details 👁️
uk: Переглянути деталі нотатки 👁️
zh_cn: 查看笔记详情 👁️

# CommandDelAll
source: Delete all notes 💣
uk: Видалити всі нотатки 💣
zh_cn: 删除所有笔记 💣

# CommandDel
source: Delete note by number 🗑️
uk: Видалити нотатку за номером 🗑️
zh_cn: 按编号删除笔记 🗑️

# CommandSearch
source: Search notes by text 🔍
uk: Шукати нотатки за текстом 🔍
zh_cn: 按文本搜索笔记 🔍

# CommandSearchTag
source: Search notes by tag 🏷️
uk: Шукати нотатки за тегом 🏷️
zh_cn: 按标签搜索笔记 🏷️

# CommandPin
source: Pin note to top of list 📌
uk: Закріпити нотатку вгорі списку 📌
zh_cn: 将笔记置顶 📌

# CommandUnpin
source: Unpin note 📎
uk: Відкріпити нотатку 📎
zh_cn: 取消置顶笔记 📎

# CommandUndo
source: Undo last deletion ↩️
uk: Скасувати останнє видалення ↩️
zh_cn: 撤销上次删除 ↩️

# CommandSort
source: Sort notes by date or text 🔄
uk: Сортувати нотатки за датою або текстом 🔄
zh_cn: 按日期或文本排序笔记 🔄

# CommandTagStyle
source: Change tag display style (bold/italic) ✨
uk: Змінити стиль відображення тегів (жирний/курсив) ✨
zh_cn: 更改标签显示样式（粗体/斜体）✨

# CommandMarkdown
source: Create multi-line markdown note 📝
uk: Створити багаторядкову Markdown нотатку 📝
zh_cn: 创建多行 Markdown 笔记 📝

# CommandSync
source: Sync notes to Git repository ☁️
uk: Синхронізувати нотатки з Git репозиторієм ☁️
zh_cn: 同步笔记到 Git 仓库 ☁️

# CommandRestore
source: Restore notes from Git repository ☁️
uk: Відновити нотатки з Git репозиторію ☁️
zh_cn: 从 Git 仓库恢复笔记 ☁️

# SettingsNotesFolderPath
source: Notes folder path
uk: Шлях до папки нотаток
zh_cn: 笔记文件夹路径

# SettingsNotesFolderPathDesc
source: Leave empty to use the default AppData location. The folder will be created if it does not exist.
uk: Залиште порожнім для використання стандартного розташування AppData. Папка буде створена, якщо не існує.
zh_cn: 留空则使用默认的 AppData 位置。如果文件夹不存在，将自动创建。

# SettingsNotesFolderPathPlaceholder
source: Example: C:\Users\User\Documents\QuickNotes
uk: Приклад: C:\Users\Користувач\Documents\QuickNotes
zh_cn: 示例：C:\Users\用户\Documents\QuickNotes

# SettingsEnableGitSync
source: Enable Git Sync
uk: Увімкнути Git синхронізацію
zh_cn: 启用 Git 同步

# SettingsEnableGitSyncDesc
source: Enable automatic synchronization with Git repository
uk: Увімкнути автоматичну синхронізацію з Git репозиторієм
zh_cn: 启用与 Git 仓库的自动同步

# SettingsGitRepositoryUrl
source: Git Repository URL
uk: URL Git репозиторію
zh_cn: Git 仓库 URL

# SettingsGitRepositoryUrlDesc
source: Example: https://github.com/username/notes.git
uk: Приклад: https://github.com/username/notes.git
zh_cn: 示例：https://github.com/username/notes.git

# SettingsGitBranch
source: Git Branch
uk: Гілка Git
zh_cn: Git 分支

# SettingsGitBranchDesc
source: Branch name (default: main)
uk: Назва гілки (за замовчуванням: main)
zh_cn: 分支名称（默认：main）

# SettingsGitUsername
source: Git Username (optional)
uk: Ім'я користувача Git (необов'язково)
zh_cn: Git 用户名（可选）

# SettingsGitUsernameDesc
source: Uses global git config if empty
uk: Використовує глобальну конфігурацію git, якщо порожнє
zh_cn: 留空则使用全局 git 配置

# SettingsGitEmail
source: Git Email (optional)
uk: Email Git (необов'язково)
zh_cn: Git 邮箱（可选）

# SettingsGitEmailDesc
source: Uses global git config if empty
uk: Використовує глобальну конфігурацію git, якщо порожнє
zh_cn: 留空则使用全局 git 配置

# NotInitialized
source: QuickNotes not initialized
uk: QuickNotes не ініціалізовано
zh_cn: QuickNotes 未初始化

# NotInitializedDesc
source: Plugin not initialized properly. Please restart PowerToys.
uk: Плагін не ініціалізовано належним чином. Будь ласка, перезапустіть PowerToys.
zh_cn: 插件未正确初始化。请重启 PowerToys。

source: Duplicate 'qq' detected
uk: Виявлено дублікат 'qq'
zh_cn: 检测到重复的 'qq'

# DuplicateQQDetectedDesc
source: Using '{0}' instead. No need to type 'qq' twice.
uk: Використовується '{0}' замість цього. Не потрібно вводити 'qq' двічі.
zh_cn: 改用 '{0}'。无需输入两次 'qq'。

# AddNote
source: Add note: {0}
uk: Додати нотатку: {0}
zh_cn: 添加笔记：{0}

# AddNoteSubtitle
source: Press Enter to save this note (with timestamp)
uk: Натисніть Enter, щоб зберегти цю нотатку (з міткою часу)
zh_cn: 按 Enter 保存此笔记（带时间戳）

# ExecuteCommand
source: Execute command '{0}'
uk: Виконати команду '{0}'
zh_cn: 执行命令 '{0}'

source: Note saved
uk: Нотатку збережено
zh_cn: 笔记已保存

# NoteSavedDesc
source: Saved: {0}
uk: Збережено: {0}
zh_cn: 已保存：{0}

source: File in use
uk: Файл використовується
zh_cn: 文件正在使用中

# FileInUseDesc
source: Notes file is used by another process. Please try again shortly.
uk: Файл нотаток використовується іншим процесом. Спробуйте пізніше.
zh_cn: 笔记文件正被其他程序使用。请稍后重试。

source: Error creating note
uk: Помилка створення нотатки
zh_cn: 创建笔记时出错

# GitSyncNotEnabled
source: ⚠️ Git Sync is not enabled
uk: ⚠️ Git синхронізацію не увімкнено
zh_cn: ⚠️ Git 同步未启用

# GitSyncNotEnabledSubtitle
source: Enable it in PowerToys Settings → PowerToys Run → Plugins → QuickNotes
uk: Увімкніть у Налаштуваннях PowerToys → PowerToys Run → Плагіни → QuickNotes
zh_cn: 在 PowerToys 设置 → PowerToys Run → 插件 → QuickNotes 中启用

source: Git Sync Disabled
uk: Git синхронізацію вимкнено
zh_cn: Git 同步已禁用

# GitSyncDisabledInstructions
source: Go to PowerToys Settings → PowerToys Run → Plugins → QuickNotes → Additional Options 1. Check 'Enable Git Sync' 2. Set your Git Repository URL 3. Configure branch (default: main) 4. Optionally set username and email
uk: Перейдіть до Налаштувань PowerToys → PowerToys Run → Плагіни → QuickNotes → Додаткові параметри 1. Позначте 'Увімкнути Git синхронізацію' 2. Встановіть URL вашого Git репозиторію 3. Налаштуйте гілку (за замовчуванням: main) 4. За бажанням встановіть ім'я користувача та email
zh_cn: 前往 PowerToys 设置 → PowerToys Run → 插件 → QuickNotes → 附加选项 1. 勾选"启用 Git 同步" 2. 设置您的 Git 仓库 URL 3. 配置分支（默认：main） 4. 可选：设置用户名和邮箱

# GitRepoNotConfigured
source: ⚠️ Git Repository not configured
uk: ⚠️ Git репозиторій не налаштовано
zh_cn: ⚠️ Git 仓库未配置

# GitRepoNotConfiguredSubtitle
source: Click to see setup instructions
uk: Натисніть, щоб переглянути інструкції з налаштування
zh_cn: 点击查看设置说明

# ConfigureGitRepo
source: Configure Git Repository
uk: Налаштувати Git репозиторій
zh_cn: 配置 Git 仓库

# ConfigureGitRepoInstructions
source: Go to PowerToys Settings → QuickNotes → Additional Options Set your repository URL: • HTTPS: https://github.com/username/notes.git • SSH: git@github.com:username/notes.git
uk: Перейдіть до Налаштувань PowerToys → QuickNotes → Додаткові параметри Встановіть URL вашого репозиторію: • HTTPS: https://github.com/username/notes.git • SSH: git@github.com:username/notes.git
zh_cn: 前往 PowerToys 设置 → QuickNotes → 附加选项 设置您的仓库 URL： • HTTPS：https://github.com/username/notes.git • SSH：git@github.com:username/notes.git

source: ❌ Git Sync Error
uk: ❌ Помилка Git синхронізації
zh_cn: ❌ Git 同步错误

# GitSyncErrorDesc
source: Could not initialize Git Sync service.
uk: Не вдалося ініціалізувати службу Git синхронізації.
zh_cn: 无法初始化 Git 同步服务。

# SyncNotesToGit
source: ☁️ Sync notes to Git repository
uk: ☁️ Синхронізувати нотатки з Git репозиторієм
zh_cn: ☁️ 同步笔记到 Git 仓库

# SyncNotesToGitSubtitle
source: Repository: {0} | Branch: {1} | Press Enter to sync
uk: Репозиторій: {0} | Гілка: {1} | Натисніть Enter для синхронізації
zh_cn: 仓库：{0} | 分支：{1} | 按 Enter 同步

source: ✅ Sync Completed
uk: ✅ Синхронізацію завершено
zh_cn: ✅ 同步完成

source: ❌ Sync Failed
uk: ❌ Синхронізація не вдалася
zh_cn: ❌ 同步失败

# RestoreFromGit
source: ⚠️ Restore notes from Git repository?
uk: ⚠️ Відновити нотатки з Git репозиторію?
zh_cn: ⚠️ 从 Git 仓库恢复笔记？

# RestoreFromGitSubtitle
source: Repository: {0} | Branch: {1} | This will replace your local notes. Press Enter to continue.
uk: Репозиторій: {0} | Гілка: {1} | Це замінить ваші локальні нотатки. Натисніть Enter для продовження.
zh_cn: 仓库：{0} | 分支：{1} | 这将替换您的本地笔记。按 Enter 继续。

source: ✅ Restore Completed
uk: ✅ Відновлення завершено
zh_cn: ✅ 恢复完成

source: ❌ Restore Failed
uk: ❌ Відновлення не вдалося
zh_cn: ❌ 恢复失败

source: Create Markdown Note
uk: Створити Markdown нотатку
zh_cn: 创建 Markdown 笔记

# CreateMarkdownNoteSubtitle
source: Open multi-line editor for markdown notes with live preview
uk: Відкрити багаторядковий редактор для Markdown нотаток з попереднім переглядом
zh_cn: 打开多行编辑器，支持 Markdown 笔记实时预览

source: Markdown Note Saved
uk: Markdown нотатку збережено
zh_cn: Markdown 笔记已保存

# MarkdownNoteSavedDesc
source: Your multi-line markdown note has been saved successfully!
uk: Вашу багаторядкову Markdown нотатку успішно збережено!
zh_cn: 您的多行 Markdown 笔记已成功保存！

# FailedToOpenMarkdownEditor
source: Failed to open markdown editor: {0}
uk: Не вдалося відкрити редактор Markdown: {0}
zh_cn: 无法打开 Markdown 编辑器：{0}

source: Search QuickNotes
uk: Пошук швидких нотаток
zh_cn: 搜索快速笔记

# SearchUsage
source: Usage: qq search <term>
uk: Використання: qq search <запит>
zh_cn: 用法：qq search <关键词>

source: No matches found
uk: Збігів не знайдено
zh_cn: 未找到匹配项

# NoNotesContain
source: No notes contain '{0}'.
uk: Жодна нотатка не містить '{0}'.
zh_cn: 没有笔记包含 '{0}'。

source: Search by Tag
uk: Пошук за тегом
zh_cn: 按标签搜索

# SearchByTagUsage
source: Usage: qq searchtag <tag> (e.g., qq searchtag work)
uk: Використання: qq searchtag <тег> (наприклад, qq searchtag робота)
zh_cn: 用法：qq searchtag <标签>（例如：qq searchtag work）

# NoNotesWithTag
source: No notes found with tag '{0}'.
uk: Нотаток з тегом '{0}' не знайдено.
zh_cn: 未找到带有标签 '{0}' 的笔记。

# FoundNoteWithTag
source: Found note with tag '{0}'. Enter to copy.
uk: Знайдено нотатку з тегом '{0}'. Enter для копіювання.
zh_cn: 找到带有标签 '{0}' 的笔记。按 Enter 复制。

source: Tag style set to bold
uk: Стиль тегів встановлено на жирний
zh_cn: 标签样式设为粗体

# TagStyleBoldDesc
source: Tags will now appear as 【#tag】
uk: Теги тепер відображатимуться як 【#тег】
zh_cn: 标签现在将显示为【#标签】

source: Tag style set to italic
uk: Стиль тегів встановлено на курсив
zh_cn: 标签样式设为斜体

# TagStyleItalicDesc
source: Tags will now appear as 〈#tag〉
uk: Теги тепер відображатимуться як 〈#тег〉
zh_cn: 标签现在将显示为〈#标签〉

source: Invalid tag style
uk: Недійсний стиль тегів
zh_cn: 无效的标签样式

# InvalidTagStyleDesc
source: Use 'qq tagstyle bold' or 'qq tagstyle italic'
uk: Використовуйте 'qq tagstyle bold' або 'qq tagstyle italic'
zh_cn: 使用 'qq tagstyle bold' 或 'qq tagstyle italic'

source: --- Pinned Notes ---
uk: --- Закріплені нотатки ---
zh_cn: --- 置顶笔记 ---

source: --- Notes ---
uk: --- Нотатки ---
zh_cn: --- 笔记 ---

# PinnedNoteSubtitle
source: Pinned | Enter to copy clean content (no timestamp/tags) | Ctrl+Click to Edit | qq unpin {0}
uk: Закріплено | Enter для копіювання чистого вмісту (без мітки часу/тегів) | Ctrl+Click для редагування | qq unpin {0}
zh_cn: 已置顶 | 按 Enter 复制纯内容（无时间戳/标签）| Ctrl+单击编辑 | qq unpin {0}

# NoteSubtitle
source: Press Enter to copy without timestamp | Ctrl+C for full note | Ctrl+Click to Edit
uk: Натисніть Enter для копіювання без мітки часу | Ctrl+C для повної нотатки | Ctrl+Click для редагування
zh_cn: 按 Enter 复制（无时间戳）| Ctrl+C 复制完整笔记 | Ctrl+单击编辑

# SearchNoteSubtitle
source: Press Enter to copy | Shift+Enter for content only | Ctrl+Click to Edit
uk: Натисніть Enter для копіювання | Shift+Enter лише для вмісту | Ctrl+Click для редагування
zh_cn: 按 Enter 复制 | Shift+Enter 仅复制内容 | Ctrl+单击编辑

source: No notes found
uk: Нотаток не знайдено
zh_cn: 未找到笔记

# NoNotesFoundDesc
source: Type 'qq <your note>' to add one, or 'qq help' for commands.
uk: Введіть 'qq <ваша нотатка>' щоб додати, або 'qq help' для команд.
zh_cn: 输入 'qq <笔记内容>' 添加笔记，或 'qq help' 查看命令。

# NoNotesMatch
source: No notes match '{0}'
uk: Жодна нотатка не відповідає '{0}'
zh_cn: 没有笔记匹配 '{0}'

# NoNotesMatchDesc
source: Try a different search or add a new note.
uk: Спробуйте інший пошук або додайте нову нотатку.
zh_cn: 尝试不同的搜索词或添加新笔记。

source: Note Details
uk: Деталі нотатки
zh_cn: 笔记详情

# NoteDetailsTooltip
source: ID: {0} Display Index: {1} Pinned: {2} Created: {3} Text: {4} Tip: Right-click for copy options or edit.
uk: ID: {0} Індекс відображення: {1} Закріплено: {2} Створено: {3} Текст: {4} Порада: Клацніть правою кнопкою миші для параметрів копіювання або редагування.
zh_cn: ID：{0} 显示序号：{1} 已置顶：{2} 创建时间：{3} 内容：{4} 提示：右键单击可查看复制选项或编辑。

source: Confirm Deletion
uk: Підтвердження видалення
zh_cn: 确认删除

# ConfirmDeleteNote
source: Delete note #{0}? {1} Press Enter to confirm
uk: Видалити нотатку #{0}? {1} Натисніть Enter для підтвердження
zh_cn: 删除笔记 #{0}？ {1} 按 Enter 确认

source: Cancel
uk: Скасувати
zh_cn: 取消

source: Keep this note
uk: Залишити цю нотатку
zh_cn: 保留此笔记

source: Note not found
uk: Нотатку не знайдено
zh_cn: 未找到笔记

# NoteNotFoundDesc
source: Note number {0} does not exist. Available: {1}
uk: Нотатка з номером {0} не існує. Доступні: {1}
zh_cn: 笔记编号 {0} 不存在。 可用编号：{1}

# MultipleMatchingNotes
source: Multiple matching notes found
uk: Знайдено кілька відповідних нотаток
zh_cn: 找到多个匹配的笔记

# MultiplePartialMatchingNotes
source: Multiple partial matching notes found
uk: Знайдено кілька частково відповідних нотаток
zh_cn: 找到多个部分匹配的笔记

# SelectNoteToDelete
source: Please select a specific note to delete:
uk: Будь ласка, виберіть конкретну нотатку для видалення:
zh_cn: 请选择要删除的笔记：

# DeleteNoteNumber
source: Delete #{0}: {1}
uk: Видалити #{0}: {1}
zh_cn: 删除 #{0}：{1}

source: [PINNED] Press Enter to delete
uk: [ЗАКРІПЛЕНО] Натисніть Enter для видалення
zh_cn: [已置顶] 按 Enter 删除

source: Press Enter to delete
uk: Натисніть Enter для видалення
zh_cn: 按 Enter 删除

# NoteNotFoundByContent
source: No note with content '{0}' was found. Try using the note number instead.
uk: Нотатку з вмістом '{0}' не знайдено. Спробуйте використати номер нотатки.
zh_cn: 未找到内容为 '{0}' 的笔记。请尝试使用笔记编号。

# NoteNotFoundInFile
source: The note was not found in the file. It may have been deleted already.
uk: Нотатку не знайдено у файлі. Можливо, її вже видалено.
zh_cn: 在文件中未找到该笔记。它可能已被删除。

source: Note deleted
uk: Нотатку видалено
zh_cn: 笔记已删除

# NoteDeletedDesc
source: Removed note #{0}: {1} Tip: Use 'qq undo' to restore the note.
uk: Видалено нотатку #{0}: {1} Порада: Використовуйте 'qq undo' для відновлення нотатки.
zh_cn: 已删除笔记 #{0}：{1} 提示：使用 'qq undo' 恢复笔记。

source: Error deleting note
uk: Помилка видалення нотатки
zh_cn: 删除笔记时出错

# ErrorDeletingNoteDesc
source: Could not delete note: {0} Please try again or restart PowerToys Run.
uk: Не вдалося видалити нотатку: {0} Спробуйте ще раз або перезапустіть PowerToys Run.
zh_cn: 无法删除笔记：{0} 请重试或重启 PowerToys Run。

source: Note pinned
uk: Нотатку закріплено
zh_cn: 笔记已置顶

source: Note unpinned
uk: Нотатку відкріплено
zh_cn: 笔记已取消置顶

source: Error pinning note
uk: Помилка закріплення нотатки
zh_cn: 置顶笔记时出错

source: Error unpinning note
uk: Помилка відкріплення нотатки
zh_cn: 取消置顶时出错

source: No notes to sort
uk: Немає нотаток для сортування
zh_cn: 没有笔记可排序

source: Invalid sort type
uk: Недійсний тип сортування
zh_cn: 无效的排序类型

# InvalidSortTypeDesc
source: Use 'qq sort date [asc|desc]' or 'qq sort alpha [asc|desc]'
uk: Використовуйте 'qq sort date [asc|desc]' або 'qq sort alpha [asc|desc]'
zh_cn: 使用 'qq sort date [asc|desc]' 或 'qq sort alpha [asc|desc]'

source: Notes sorted
uk: Нотатки відсортовано
zh_cn: 笔记已排序

# NotesSortedDesc
source: Sorted by {0} {1}
uk: Відсортовано за {0} {1}
zh_cn: 按 {0} {1} 排序

source: Error sorting notes
uk: Помилка сортування нотаток
zh_cn: 排序笔记时出错

# EditNoteNumber
source: Edit note #{0}
uk: Редагувати нотатку #{0}
zh_cn: 编辑笔记 #{0}

# EditNoteSubtitle
source: Press Enter to edit: {0}
uk: Натисніть Enter для редагування: {0}
zh_cn: 按 Enter 编辑：{0}

source: Edit QuickNote
uk: Редагувати швидку нотатку
zh_cn: 编辑快速笔记

source: Error saving edited note
uk: Помилка збереження відредагованої нотатки
zh_cn: 保存编辑的笔记时出错

# CouldNotFindNoteInFile
source: Could not find the note in the file.
uk: Не вдалося знайти нотатку у файлі.
zh_cn: 在文件中找不到该笔记。

# CouldNotFindNoteToSaveEdit
source: Could not find note to save edit. Refresh and retry.
uk: Не вдалося знайти нотатку для збереження редагування. Оновіть і спробуйте знову.
zh_cn: 无法找到笔记以保存编辑。请刷新后重试。

source: Error saving note
uk: Помилка збереження нотатки
zh_cn: 保存笔记时出错

# ViewNoteSubtitle
source: Press Enter to copy without timestamp | Ctrl+C for full note | Right-click for options
uk: Натисніть Enter для копіювання без мітки часу | Ctrl+C для повної нотатки | Права кнопка для параметрів
zh_cn: 按 Enter 复制（无时间戳）| Ctrl+C 复制完整笔记 | 右键查看选项

source: No notes file to backup
uk: Немає файлу нотаток для резервного копіювання
zh_cn: 没有笔记文件可备份

# NotesFileDoesntExist
source: The notes file doesn't exist.
uk: Файл нотаток не існує.
zh_cn: 笔记文件不存在。

source: Backup created
uk: Резервну копію створено
zh_cn: 备份已创建

# BackupCreatedDesc
source: Backup saved to: {0} Backup folder opened.
uk: Резервну копію збережено до: {0} Папку резервних копій відкрито.
zh_cn: 备份已保存到：{0} 已打开备份文件夹。

source: Error creating backup
uk: Помилка створення резервної копії
zh_cn: 创建备份时出错

source: No notes file to export
uk: Немає файлу нотаток для експорту
zh_cn: 没有笔记文件可导出

source: No notes to export
uk: Немає нотаток для експорту
zh_cn: 没有笔记可导出

# NotesFileEmpty
source: Your notes file is empty.
uk: Ваш файл нотаток порожній.
zh_cn: 您的笔记文件为空。

source: Export created
uk: Експорт створено
zh_cn: 导出已创建

# ExportCreatedDesc
source: Export saved to: {0} Export folder opened.
uk: Експорт збережено до: {0} Папку експорту відкрито.
zh_cn: 导出已保存到：{0} 已打开导出文件夹。

source: Error creating export
uk: Помилка створення експорту
zh_cn: 创建导出时出错

source: QuickNotes Help
uk: Довідка швидких нотаток
zh_cn: 快速笔记帮助

# HelpText
source: qq <text> Add note ✏️ | qq pin <N> Pin note 📌 qq search <text> Search notes 🔍 | qq searchtag <tag> Search by tag qq view <N> View note | qq sort <field> <dir> Sort notes qq edit <N> <new text> Edit note ✏️ | qq pin/unpin <N> Pin/unpin note 📌 qq del <N> Delete note 🗑️ | qq backup/export Backup/Export notes 💾 qq delall Delete all notes | qq undo Undo last delete qq tagstyle <style> hash/fancy style
uk: qq <текст> Додати нотатку ✏️ | qq pin <N> Закріпити 📌 qq search <текст> Пошук нотаток 🔍 | qq searchtag <тег> Пошук за тегом qq view <N> Перегляд нотатки | qq sort <поле> <напр> Сортування qq edit <N> <новий текст> Редагування ✏️ | qq pin/unpin <N> Закріпити/Відкріпити 📌 qq del <N> Видалити нотатку 🗑️ | qq backup/export Резервна копія/Експорт 💾 qq delall Видалити всі | qq undo Скасувати видалення qq tagstyle <стиль> Стиль тегів
zh_cn: qq <文本> 添加笔记 ✏️ | qq pin <N> 置顶笔记 📌 qq search <文本> 搜索笔记 🔍 | qq searchtag <标签> 按标签搜索 qq view <N> 查看笔记 | qq sort <字段> <方向> 排序笔记 qq edit <N> <新文本> 编辑笔记 ✏️ | qq pin/unpin <N> 置顶/取消 📌 qq del <N> 删除笔记 🗑️ | qq backup/export 备份/导出 💾 qq delall 删除所有笔记 | qq undo 撤销删除 qq tagstyle <样式> 标签样式切换

# ConfirmDeleteAll
source: Confirm deletion of ALL notes
uk: Підтвердження видалення ВСІХ нотаток
zh_cn: 确认删除所有笔记

# ConfirmDeleteAllDesc
source: This will permanently delete all {0} notes. Are you sure?
uk: Це назавжди видалить усі {0} нотаток. Ви впевнені?
zh_cn: 这将永久删除所有 {0} 条笔记。确定吗？

# KeepYourNotes
source: Keep your notes (no changes made)
uk: Залишити ваші нотатки (без змін)
zh_cn: 保留笔记（不做更改）

source: All notes deleted
uk: Усі нотатки видалено
zh_cn: 所有笔记已删除

# AllNotesDeletedDesc
source: All notes have been permanently deleted. You can find a backup in the same folder.
uk: Усі нотатки було назавжди видалено. Резервну копію можна знайти в тій самій папці.
zh_cn: 所有笔记已被永久删除。您可以在同一文件夹中找到备份。

source: No notes to delete
uk: Немає нотаток для видалення
zh_cn: 没有笔记可删除

# NotesFileAlreadyEmpty
source: Your notes file is already empty.
uk: Ваш файл нотаток вже порожній.
zh_cn: 您的笔记文件已经是空的。

source: Error deleting all notes
uk: Помилка видалення всіх нотаток
zh_cn: 删除所有笔记时出错

source: Nothing to undo
uk: Нічого скасовувати
zh_cn: 没有可撤销的操作

# NothingToUndoDesc
source: No recently deleted note. Delete one first.
uk: Немає нещодавно видаленої нотатки. Спочатку видаліть одну.
zh_cn: 没有最近删除的笔记。请先删除一条笔记。

source: Note restored
uk: Нотатку відновлено
zh_cn: 笔记已恢复

# NoteRestoredDesc
source: Restored note{0}. {1}
uk: Відновлено нотатку{0}. {1}
zh_cn: 已恢复笔记{0}。 {1}

source: Error restoring note
uk: Помилка відновлення нотатки
zh_cn: 恢复笔记时出错

source: Invalid note number
uk: Недійсний номер нотатки
zh_cn: 无效的笔记编号

# InvalidNoteNumberDesc
source: Specify a valid positive number. E.g. 'qq del 3'
uk: Вкажіть дійсне додатне число. Наприклад: 'qq del 3'
zh_cn: 请指定一个有效的正数。例如：'qq del 3'

# NoNotesToOperate
source: No notes to operate on. Add a note first.
uk: Немає нотаток для операції. Спочатку додайте нотатку.
zh_cn: 没有可操作的笔记。请先添加一条笔记。

# NoteNumberDoesNotExist
source: Note #{0} does not exist. Highest is {1}. Available: {2}
uk: Нотатка #{0} не існує. Найбільший номер {1}. Доступні: {2}
zh_cn: 笔记 #{0} 不存在。最大编号为 {1}。 可用编号：{2}

# NoteDoesNotExist
source: Note #{0} does not exist. Available: {1}
uk: Нотатка #{0} не існує. Доступні: {1}
zh_cn: 笔记 #{0} 不存在。可用编号：{1}

# CopyFullNote
source: Copy Full Note (with timestamp)
uk: Копіювати повну нотатку (з міткою часу)
zh_cn: 复制完整笔记（含时间戳）

# CopyCleanContent
source: Copy Clean Content (no timestamp, no tags)
uk: Копіювати чистий вміст (без мітки часу, без тегів)
zh_cn: 复制纯内容（无时间戳和标签）

source: Edit Note...
uk: Редагувати нотатку...
zh_cn: 编辑笔记...

source: Delete Note
uk: Видалити нотатку
zh_cn: 删除笔记

source: Pin Note
uk: Закріпити нотатку
zh_cn: 置顶笔记

source: Unpin Note
uk: Відкріпити нотатку
zh_cn: 取消置顶

# OpenUrl
source: Open URL: {0}
uk: Відкрити URL: {0}
zh_cn: 打开链接：{0}

# FailedToCopy
source: Failed to copy: {0}
uk: Не вдалося скопіювати: {0}
zh_cn: 复制失败：{0}

# CouldNotOpenUrl
source: Could not open URL: {0}
uk: Не вдалося відкрити URL: {0}
zh_cn: 无法打开链接：{0}

# FailedToCopyNote
source: Failed to copy note: {0}
uk: Не вдалося скопіювати нотатку: {0}
zh_cn: 复制笔记失败：{0}

source: Error
uk: Помилка
zh_cn: 错误

source: Error reading notes
uk: Помилка читання нотаток
zh_cn: 读取笔记时出错

source: Error writing notes
uk: Помилка запису нотаток
zh_cn: 写入笔记时出错

# MarkdownEditorTitle
source: QuickNotes - Markdown Editor
uk: QuickNotes - Редактор Markdown
zh_cn: 快速笔记 - Markdown 编辑器

source: Markdown Input:
uk: Введення Markdown:
zh_cn: Markdown 输入：

source: Preview:
uk: Попередній перегляд:
zh_cn: 预览：

# PreviewPlaceholder
source: Preview will appear here...
uk: Попередній перегляд з'явиться тут...
zh_cn: 预览将在此处显示...

source: Markdown Syntax Help
uk: Довідка синтаксису Markdown
zh_cn: Markdown 语法帮助

# SaveNote
source: Save Note (Ctrl+Enter)
uk: Зберегти нотатку (Ctrl+Enter)
zh_cn: 保存笔记 (Ctrl+Enter)

source: Cancel (Esc)
uk: Скасувати (Esc)
zh_cn: 取消 (Esc)

source: Empty Note
uk: Порожня нотатка
zh_cn: 空笔记

# PleaseEnterText
source: Please enter some text for your note.
uk: Будь ласка, введіть текст для вашої нотатки.
zh_cn: 请输入笔记内容。

# MarkdownEditorInstructions
source: Use markdown syntax for formatting. Press Ctrl+Enter to save, Escape to cancel.
uk: Використовуйте синтаксис Markdown для форматування. Натисніть Ctrl+Enter для збереження, Escape для скасування.
zh_cn: 使用 Markdown 语法进行格式化。按 Ctrl+Enter 保存，按 Escape 取消。

source: Unknown
uk: Невідомо
zh_cn: 未知

source: descending
uk: за спаданням
zh_cn: 降序

source: ascending
uk: за зростанням
zh_cn: 升序

source: (default asc)
uk: (за замовчуванням зростання)
zh_cn: （默认升序）

# NowNoteNumber
source: (now note #{0})
uk: (тепер нотатка #{0})
zh_cn: （现为笔记 #{0}）

source: Details:
uk: Деталі:
zh_cn: 详情：
